БИТУправление_медицинским_центром_демо/src/InformationRegisters/НазначенияСвойствОбъектов/НазначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначенияСвойствОбъектов</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Заявка</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>Boolean</types>
    <types>CatalogRef.Клиенты</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>String</types>
    <types>CatalogRef.Сотрудники</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>УдалитьСрокГодности</name>
      <description>(не используется) Срок годности</description>
      <code>00001</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Отбор</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

БИТУправление_медицинским_центром_демо/src/CommonModules/СвойстваИЗначенияСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает список доступных назначений для "Свойств и категорий объектов" по переданной ссылке.
//
// Параметры:
// 	Ссылка - Ссылка на справочник или документ.
//
// Возвращаемое значение:
// Список значений: доступные назначения для свойств и категорий.
//
Функция ПолучитьСписокНазначенийСвойствКатегорийОбъектовПоСсылке(Ссылка) Экспорт

	Результат = Новый СписокЗначений;

	ТипСсылки = ТипЗнч(Ссылка);
	ЭтоХарактеристика = (ТипСсылки = Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначениеХарактеристика", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Назначения.Ссылка КАК Ссылка,
	|	Назначения.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.НазначенияСвойствКатегорийОбъектов КАК Назначения
	|ГДЕ
	|	НЕ Назначения.ПометкаУдаления
	|	И НЕ Назначения.ЭтоГруппа
	|";

	Если ЭтоХарактеристика Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И Назначения.Ссылка = &НазначениеХарактеристика
		|";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|	И Назначения.Ссылка <> &НазначениеХарактеристика
		|";
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЭтоХарактеристика Или Выборка.ТипЗначения.СодержитТип(ТипСсылки) Тогда
			Результат.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции // ПолучитьСписокНазначенийСвойствКатегорийОбъектовПоСсылке()

// Процедура пересчитывает значения свойств объекта и записывает их в регистр сведений - ЗначенияСвойствОбъектов.
//
// Параметры:
//  Источник - СправочникОбъект.Номенклатура	 - Пересчитываемый объект.
//  Отказ	 - Булево	 - Флаг отмены записи объекта.
//
Процедура ПересчитатьЗначенияСвойствОбъекта(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Проверить, есть ли авторасчитываемые свойства.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
	Запрос.УстановитьПараметр("Объект", Источник.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвойстваОбъектовОтборы.Ссылка КАК Свойство
	|ПОМЕСТИТЬ Свойства
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов.Отборы КАК СвойстваОбъектовОтборы
	|ГДЕ
	|	СвойстваОбъектовОтборы.Ссылка.НазначениеСвойства = &НазначениеСвойства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Свойство КАК Свойство
	|ИЗ
	|	Свойства КАК Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенияСвойствОбъектов КАК НазначенияСвойствОбъектов
	|		ПО Свойства.Свойство = НазначенияСвойствОбъектов.Свойство
	|ГДЕ
	|	(НазначенияСвойствОбъектов.Объект ЕСТЬ NULL
	|			ИЛИ НазначенияСвойствОбъектов.Объект = &Объект)";
	ВыбСвойства = Запрос.Выполнить().Выбрать();
	Если ВыбСвойства.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем значения в регистр
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
	
	ОтборыОбъекта = Новый Структура;
	
	// Задаем параметры для проверки отбора
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		СКД = ПланыВидовХарактеристик.СвойстваОбъектов.ПолучитьМакет("МакетОтбораНоменклатуры");
		ОтборыОбъекта.Вставить("Номенклатура", Источник.Ссылка);
	Иначе
		Возврат;
	КонецЕсли;
	
	Пока ВыбСвойства.Следующий() Цикл
		
		ПересчитатьЗначениеСвойстваОбъекта(Источник.Ссылка, ВыбСвойства.Свойство, СКД, ОтборыОбъекта);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура пересчитывает значение свойства объекта.
//
// Параметры:
//  Объект	 - Ссылка на справочник или документ.
//  Свойство - ПланВидовХарактеристик.СвойстваОбъектов	 - Свойство.
//
Процедура ПересчитатьЗначениеСвойстваОбъекта(Объект, Свойство, СКД = Неопределено, ОтборыОбъекта = Неопределено) Экспорт
	
	Если ОтборыОбъекта = Неопределено Тогда
		
		ОтборыОбъекта = Новый Структура;
		// Задаем параметры для выполнения отбора
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
			ОтборыОбъекта.Вставить("Номенклатура", Объект);
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.Номенклатура") Тогда
			ОтборыОбъекта.Вставить("Номенклатура", Объект.Ссылка);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СКД = Неопределено Тогда
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.Номенклатура") Тогда
			СКД = ПланыВидовХарактеристик.СвойстваОбъектов.ПолучитьМакет("МакетОтбораНоменклатуры");
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Свойство = Свойство;
	
	Значение = УниверсальныеМеханизмыСервер.ВычислитьЗначениеПоТаблицеОтборовСКД(СКД, 
																				 Свойство.Отборы,
																				 Свойство.ЗначениеПоУмолчанию,
																				 ОтборыОбъекта,
																				 "Значение");
	Если ЗначениеЗаполнено(Значение) Тогда
		Запись.Значение = Значение;
		Запись.Записать();
	Иначе
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает Истина, если свойство рассчитывается автоматически.
//
// Параметры:
//  Свойство - ПланВидовХарактеристикСсылка.СвойстваОбъектов - проверяемое свойство.
// 
// Возвращаемое значение:
//   - Булево.
//
Функция СвойствоРассчитываетсяАвтоматически(Свойство) Экспорт
	
	Возврат Свойство.Отборы.Количество() <> 0;
	
КонецФункции

// Записывает значения свойств при записи в форме объекта.
//
// Параметры:
//  ТекущийОбъект		 - ПланыВидовХарактеристикСсылка.НазначениеСвойствОбъектов	 - Владелец значений свойств.
//  СвойстваИЗначения	 - ТаблицаФормы - Табличная часть обработки ЗначенияСвойствОбъектов на форме.
//
Процедура ПодготовитьКЗаписиЗначенияСвойствВФорме(ТекущийОбъект, СвойстваИЗначения) Экспорт
	
	Если СвойстваИЗначения.Количество() <> 0 Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗначенияСвойствОбъекта", СвойстваИЗначения.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры


// Записывает значения свойств при записи в форме объекта.
//
// Параметры:
//  Объект				 - ПланыВидовХарактеристикСсылка.НазначениеСвойствОбъектов	 - Владелец значений свойств.
//  СвойстваИЗначения	 - ТаблицаФормы - Табличная часть обработки ЗначенияСвойствОбъектов на форме.
//
Процедура ЗаписатьЗначенияСвойствВФорме(Объект, СвойстваИЗначения) Экспорт
	
	АвтоРассчитываемыеСвойства = Новый Массив;
	
	ОбъектСсылка = ?(ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект)), Объект, Объект.Ссылка);
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		Для Каждого СтрокаСвойств Из СвойстваИЗначения Цикл
			Если СвойстваИЗначенияСервер.СвойствоРассчитываетсяАвтоматически(СтрокаСвойств.Свойство) Тогда
				АвтоРассчитываемыеСвойства.Добавить(СтрокаСвойств.Свойство);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	
	Если АвтоРассчитываемыеСвойства.Количество() <> 0 Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	ТаблицаНабора = НаборЗаписей.Выгрузить();
	
	Для Каждого СтрокаСвойств Из СвойстваИЗначения Цикл
		Если АвтоРассчитываемыеСвойства.Найти(СтрокаСвойств.Свойство) = Неопределено Тогда
			Запись = ТаблицаНабора.Найти(СтрокаСвойств.Свойство, "Свойство");
			Если ЗначениеЗаполнено(СтрокаСвойств.Значение) Тогда
				Если Запись = Неопределено Тогда
					Запись = ТаблицаНабора.Добавить();
					Запись.Объект = ОбъектСсылка;
					Запись.Свойство = СтрокаСвойств.Свойство;
				КонецЕсли;
				Запись.Значение = СтрокаСвойств.Значение;
			ИначеЕсли Запись <> Неопределено Тогда
				ТаблицаНабора.Удалить(Запись);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТаблицаНабора);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗначенияСвойствОбъектаЗаписьПриЗаписиОбъекта(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗначенияСвойствОбъекта") Тогда
		ЗаписатьЗначенияСвойствВФорме(Источник.Ссылка, Источник.ДополнительныеСвойства.ЗначенияСвойствОбъекта);
		Источник.ДополнительныеСвойства.Удалить("ЗначенияСвойствОбъекта");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
